tap "auth0/auth0-cli"
tap "coursier/formulas"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "osx-cross/avr", "git@github.com:osx-cross/homebrew-avr.git"
tap "px4/px4"
tap "rcmdnk/file"
tap "scalacenter/bloop"
tap "shibukk/git-xlsx-textconv"
brew "jpeg-xl"
brew "aom"
brew "boost"
brew "avrdude"
brew "brew-cask-completion"
brew "pycparser"
brew "cffi"
brew "clang-format"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "dfu-programmer"
brew "dfu-util"
brew "direnv"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "exiftool"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "tesseract"
brew "ffmpeg"
brew "figlet"
brew "fnm"
brew "libavif"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "gnupg"
brew "gpgme"
brew "gmime"
brew "gnu-sed"
brew "go"
brew "python@3.11"
brew "gobject-introspection"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "guile"
brew "hub"
brew "libheif"
brew "python@3.9"
brew "libraw"
brew "imagemagick"
brew "isync"
brew "jenv"
brew "jq"
brew "libimobiledevice"
brew "memcached", restart_service: true
brew "mysql@5.7", restart_service: true
brew "python@3.12"
brew "notmuch"
brew "neomutt"
brew "nghttp2"
brew "nnn"
brew "node"
brew "plantuml"
brew "pnpm"
brew "pyenv"
brew "python@3.10"
brew "python@3.8"
brew "qt@5"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "sbt"
brew "scalaenv"
brew "sendemail"
brew "sheldon"
brew "sl"
brew "starship"
brew "switchaudio-osx"
brew "telnet"
brew "tfenv"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "xpdf"
brew "yarn"
brew "zsh"
brew "auth0/auth0-cli/auth0"
brew "coursier/formulas/coursier"
brew "osx-cross/avr/avr-gcc@9"
brew "px4/px4/gcc-arm-none-eabi"
brew "rcmdnk/file/brew-file"
brew "scalacenter/bloop/bloop"

brew "viu"

cask "alacritty"
cask "alt-tab"
cask "android-sdk"
cask "font-fira-code"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "klogg"
cask "secretive"

cask "jetbrains-toolbox"
cask "slack"
cask "google-japanese-ime"
cask "itsycal"
cask "visual-studio-code"
cask "docker"
cask "postman"
cask "zoom"
cask "raycast"
cask "microsoft-edge"
cask "obsidian"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "hammerspoon"
cask "sequel-ace"
cask "keka"
cask "coconutbattery"
cask "coteditor"
cask "appcleaner"
cask "fuwari"
cask "applite"

vscode "aferri.avb"
vscode "alefragnani.project-manager"
vscode "Angular.ng-template"
vscode "ashinzekene.nestjs"
vscode "be5invis.vscode-custom-css"
vscode "buenon.scratchpads"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.vscode-pull-request-github"
vscode "GrapeCity.gc-excelviewer"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "illixion.vscode-vibrancy-continued"
vscode "jebbs.plantuml"
vscode "JonaNeumeier.endpoints"
vscode "junstyle.php-cs-fixer"
vscode "k--kato.intellij-idea-keybindings"
vscode "lightbend.vscode-sbt-scala"
vscode "liviuschera.noctis"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "Oracle.oracle-java"
vscode "Orta.vscode-jest"
vscode "redhat.vscode-yaml"
vscode "scala-lang.scala"
vscode "scala-lang.scala-snippets"
vscode "scalameta.metals"
vscode "serkonda7.vscode-vba"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "taichi.vscode-textlint"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscode-icons-team.vscode-icons"
vscode "ZainChen.json"
vscode "Zignd.html-css-class-completion"
